bench_result/value-256_mem-8388608.out
/home/eros/workspace-lsm/Thanoskv2/build/db_bench --num=1000000 --value_size=256 --benchmarks=fillrandom,stats,readrandom,stats --write_buffer_size=8388608 >> /home/eros/workspace-lsm/Thanoskv2/bench_result/value-256_mem-8388608.out
Default db path: /mnt/pmemdir/-1000/dbbench
Creating NVM pool size of 4294967296
Keys:       16 bytes each
Values:     256 bytes each (128 bytes after compression)
Entries:    1000000
RawSize:    259.4 MB (estimated)
FileSize:   137.3 MB (estimated)
------------------------------------------------
Final Use NVM: 0 GB
Remainder of NVM space : 8.64084 GB
fillrandom   :       2.038 micros/op;  127.3 MB/s 2.04 s

write in SSD size (MB):68.2888
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        2       16         0        0       322
  1        2       32         0        0        14
  2        4      128         0        0        13

readrandom   :       1.988 micros/op;  130.5 MB/s (1000000 of 1000000 found) 1.99 s

write in SSD size (MB):102.438
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        2       16         0        0       322
  1        2       32         0        0        14
  2        2       64         0        0        13

pmem allocs 616764
Final Use NVM: 0.109376 GB
Remainder of NVM space : 8.34382 GB