bench_result/value-4096_mem-16777216.out
/home/eros/workspace-lsm/Thanoskv2/build/db_bench --num=1000000 --value_size=4096 --benchmarks=fillrandom,stats,readrandom,stats --write_buffer_size=16777216 >> /home/eros/workspace-lsm/Thanoskv2/bench_result/value-4096_mem-16777216.out
Default db path: /mnt/pmemdir/-1000/dbbench
Creating NVM pool size of 4294967296
Keys:       16 bytes each
Values:     4096 bytes each (2048 bytes after compression)
Entries:    1000000
RawSize:    3921.5 MB (estimated)
FileSize:   1968.4 MB (estimated)
------------------------------------------------
Final Use NVM: 0 GB
Remainder of NVM space : 5.75312 GB
fillrandom   :       4.626 micros/op;  847.7 MB/s 4.63 s

write in SSD size (MB):1033.42
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        1       16         2        0      3970
  1        1       32         0        0        15
  2       32     2048         0        0        15

readrandom   :       3.021 micros/op; 1295.9 MB/s (998193 of 1000000 found) 3.02 s

write in SSD size (MB):1781.92
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        2       32         2        0      3986
  1        1       32         0        0        15
  2       11      704         0        0        15

pmem allocs 828834
Final Use NVM: 0.750114 GB
Remainder of NVM space : 1.8767 GB