bench_result/value-4096_mem-2097152.out
/home/eros/workspace-lsm/Thanoskv2/build/db_bench --num=1000000 --value_size=4096 --benchmarks=fillrandom,stats,readrandom,stats --write_buffer_size=2097152 >> /home/eros/workspace-lsm/Thanoskv2/bench_result/value-4096_mem-2097152.out
Default db path: /mnt/pmemdir/-1000/dbbench
Creating NVM pool size of 4294967296
Keys:       16 bytes each
Values:     4096 bytes each (2048 bytes after compression)
Entries:    1000000
RawSize:    3921.5 MB (estimated)
FileSize:   1968.4 MB (estimated)
------------------------------------------------
Final Use NVM: 0 GB
Remainder of NVM space : 8.33519 GB
fillrandom   :       4.911 micros/op;  798.5 MB/s 4.91 s

write in SSD size (MB):991.597
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        1        2         3        0      3985
  1        3       12         2        0        15
  2      273     2185         1        0        15

readrandom   :       5.791 micros/op;  677.2 MB/s (1000000 of 1000000 found) 5.79 s

write in SSD size (MB):2212.29
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        2        4         3        0      3987
  1        1        4         2        0        15
  2        2       16         1        0        15

pmem allocs 1025995
Final Use NVM: 0.0234479 GB
Remainder of NVM space : 4.45262 GB