bench_result/value-4096_mem-4194304.out
/home/eros/workspace-lsm/Thanoskv2/build/db_bench --num=1000000 --value_size=4096 --benchmarks=fillrandom,stats,readrandom,stats --write_buffer_size=4194304 >> /home/eros/workspace-lsm/Thanoskv2/bench_result/value-4096_mem-4194304.out
Default db path: /mnt/pmemdir/-1000/dbbench
Creating NVM pool size of 4294967296
Keys:       16 bytes each
Values:     4096 bytes each (2048 bytes after compression)
Entries:    1000000
RawSize:    3921.5 MB (estimated)
FileSize:   1968.4 MB (estimated)
------------------------------------------------
Final Use NVM: 0 GB
Remainder of NVM space : 7.81069 GB
fillrandom   :       4.701 micros/op;  834.1 MB/s 4.70 s

write in SSD size (MB):1039.92
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        1        4         2        0      3983
  1        3       24         1        0        15
  2      130     2081         1        0        15

readrandom   :       4.611 micros/op;  850.6 MB/s (1000000 of 1000000 found) 4.61 s

write in SSD size (MB):2115.82
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        2        8         2        0      3987
  1        1        8         1        0        15
  2       11      176         1        0        15

pmem allocs 982035
Final Use NVM: 0.187576 GB
Remainder of NVM space : 3.9319 GB