bench_result/value-4096_mem-67108864.out
/home/eros/workspace-lsm/Thanoskv2/build/db_bench --num=1000000 --value_size=4096 --benchmarks=fillrandom,stats,readrandom,stats --write_buffer_size=67108864 >> /home/eros/workspace-lsm/Thanoskv2/bench_result/value-4096_mem-67108864.out
Default db path: /mnt/pmemdir/-1000/dbbench
Creating NVM pool size of 4294967296
Keys:       16 bytes each
Values:     4096 bytes each (2048 bytes after compression)
Entries:    1000000
RawSize:    3921.5 MB (estimated)
FileSize:   1968.4 MB (estimated)
------------------------------------------------
Final Use NVM: 0 GB
Remainder of NVM space : 3.9206 GB
fillrandom   :       5.454 micros/op;  719.0 MB/s 5.45 s

write in SSD size (MB):974.006
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        1       64         1        0      3922
  1        2      256         0        0        15
  2        7     1792         0        0        14

readrandom   :       2.519 micros/op; 1556.9 MB/s (1000000 of 1000000 found) 2.52 s

write in SSD size (MB):1530.85
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        2      128         1        0      3986
  1        2      256         0        0        15
  2        3      768         0        0        14

pmem allocs 713726
Final Use NVM: 1.12504 GB
Remainder of NVM space : 0.0453682 GB