bench_result/value-4096_mem-8388608.out
/home/eros/workspace-lsm/Thanoskv2/build/db_bench --num=1000000 --value_size=4096 --benchmarks=fillrandom,stats,readrandom,stats --write_buffer_size=8388608 >> /home/eros/workspace-lsm/Thanoskv2/bench_result/value-4096_mem-8388608.out
Default db path: /mnt/pmemdir/-1000/dbbench
Creating NVM pool size of 4294967296
Keys:       16 bytes each
Values:     4096 bytes each (2048 bytes after compression)
Entries:    1000000
RawSize:    3921.5 MB (estimated)
FileSize:   1968.4 MB (estimated)
------------------------------------------------
Final Use NVM: 0 GB
Remainder of NVM space : 6.74117 GB
fillrandom   :       4.647 micros/op;  843.9 MB/s 4.65 s

write in SSD size (MB):1055.83
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        1        8         2        0      3979
  1        3       48         1        0        15
  2       63     2017         0        0        15

readrandom   :       3.582 micros/op; 1094.0 MB/s (999246 of 1000000 found) 3.58 s

write in SSD size (MB):1932.84
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        2       16         2        0      3987
  1        1       16         1        0        15
  2       15      480         0        0        15

pmem allocs 898140
Final Use NVM: 0.500194 GB
Remainder of NVM space : 2.86404 GB